
#"text": "학부(과)전공제2전공학번학년이름입학구분전화번호졸업요구학점이수학점\n컴퓨터공학과 201808763천민우신입학010-4783-234913376\n교필영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n국어컴퓨터공학부교필기초글쓰기 3A020181학기\n기독교파이데이아학부교필현대인과성경 3B020212학기\n파이데이아학부교필현대인과기독교 3B020221학기\n사회봉사파이데이아학부교필사회봉사 1P20212학기\n영어(회화)파이데이아학부교필영어커뮤니케이션(1) 2C+20181학기\n파이데이아학부교필영어커뮤니케이션(2) 2B020212학기\n파이데이아포럼파이데이아학부교필파이데이아포럼 1P20181학기\n파이데이아학부교필대학생활과진로 1P20221학기\n파이데이아학부교필채플(제자반) 0P20181학기\n교선영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n3영역컴퓨터공학부교선대학수학 3A+20181학기\n파이데이아학부교선대학물리학(2) 3C020212학기\n파이데이아학부교선이산수학 3C+20212학기\n4영역파이데이아학부교선선형대수학 3B+20221학기\n파이데이아학부교선파이썬(Python)과함께하는코딩3A+20222학기\n파이데이아학부교선확률과통계 3A+20222학기\n컴퓨터공학부교선대학물리학(1) 3B020181학기\n파이데이아학부교선채플(제자반) 0P20212학기\n파이데이아학부교선채플 0P20221학기\n파이데이아학부교선채플 0P20222학기\n교양요구학점:37교양이수학점:37\n전필영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n컴퓨터공학부전필C프로그래밍 3A020181학기\n컴퓨터공학부전필컴퓨터공학입문 3C+20181학기\n컴퓨터공학과전필창의적공학설계 3B020212학기\n컴퓨터공학과전필데이터구조 3B020221학기\n컴퓨터공학과전필자바프로그래밍 3B+20221학기\n컴퓨터공학과전필데이터베이스 3A+20222학기\n컴퓨터공학과전필컴퓨터네트워크 3A020222학기\n전필요구학점:39전필이수학점:21\n전선영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n컴퓨터공학과전선C프로그래밍응용 3C020212학기\n컴퓨터공학과전선★파이썬프로그래밍 -F20212학기\n컴퓨터공학과전선윈도우프로그래밍 3A+20221학기\n컴퓨터공학과전선유닉스와리눅스 3B+20221학기\n컴퓨터공학과전선논리회로 3A+20222학기\n컴퓨터공학과전선웹표준기술 3B+20222학기\n컴퓨터공학과전선파이썬프로그래밍(재수)3A020222학기\n전선요구학점:27전선이수학점:18\n복필영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n복수전공필수요구학점:0복수전공필수이수학점:0\n복전영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n복수전공요구학점:0복수전공이수학점:0\n부전공영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n부전공요구학점:0부전공이수학점:0학부(과)전공제2전공학번학년이름입학구분전화번호졸업요구학점이수학점\n컴퓨터공학과 201808763천민우신입학010-4783-234913376\n일선영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n일선이수학점:\n교직영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n교직이수학점:0\n졸업사정결과\n교필:16.0교선:21.0전필:21.0전선:18.0일선:0.0교직:0.0복필:0.0부전:0.0복전:0.0\n총취득학점:76총평점평균:3.48채플:41편입학인정학점:학점"
 
 
def Make_Ex(mlist):
    # 개인소속학과=mlist.split()[0]
    # 개인학번=str(mlist.split()[1])[0:7]
    # print(개인소속학과, 개인학번)
    print(mlist[0][0:2])

import sys

orgin= "학부(과)전공제2전공학번학년이름입학구분전화번호졸업요구학점이수학점\n컴퓨터공학과 201808763천민우신입학010-4783-234913376\n교필영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n국어컴퓨터공학부교필기초글쓰기 3A020181학기\n기독교파이데이아학부교필현대인과성경 3B020212학기\n파이데이아학부교필현대인과기독교 3B020221학기\n사회봉사파이데이아학부교필사회봉사 1P20212학기\n영어(회화)파이데이아학부교필영어커뮤니케이션(1) 2C+20181학기\n파이데이아학부교필영어커뮤니케이션(2) 2B020212학기\n파이데이아포럼파이데이아학부교필파이데이아포럼 1P20181학기\n파이데이아학부교필대학생활과진로 1P20221학기\n파이데이아학부교필채플(제자반) 0P20181학기\n교선영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n3영역컴퓨터공학부교선대학수학 3A+20181학기\n파이데이아학부교선대학물리학(2) 3C020212학기\n파이데이아학부교선이산수학 3C+20212학기\n4영역파이데이아학부교선선형대수학 3B+20221학기\n파이데이아학부교선파이썬(Python)과함께하는코딩3A+20222학기\n파이데이아학부교선확률과통계 3A+20222학기\n컴퓨터공학부교선대학물리학(1) 3B020181학기\n파이데이아학부교선채플(제자반) 0P20212학기\n파이데이아학부교선채플 0P20221학기\n파이데이아학부교선채플 0P20222학기\n교양요구학점:37교양이수학점:37\n전필영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n컴퓨터공학부전필C프로그래밍 3A020181학기\n컴퓨터공학부전필컴퓨터공학입문 3C+20181학기\n컴퓨터공학과전필창의적공학설계 3B020212학기\n컴퓨터공학과전필데이터구조 3B020221학기\n컴퓨터공학과전필자바프로그래밍 3B+20221학기\n컴퓨터공학과전필데이터베이스 3A+20222학기\n컴퓨터공학과전필컴퓨터네트워크 3A020222학기\n전필요구학점:39전필이수학점:21\n전선영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n컴퓨터공학과전선C프로그래밍응용 3C020212학기\n컴퓨터공학과전선★파이썬프로그래밍 -F20212학기\n컴퓨터공학과전선윈도우프로그래밍 3A+20221학기\n컴퓨터공학과전선유닉스와리눅스 3B+20221학기\n컴퓨터공학과전선논리회로 3A+20222학기\n컴퓨터공학과전선웹표준기술 3B+20222학기\n컴퓨터공학과전선파이썬프로그래밍(재수)3A020222학기\n전선요구학점:27전선이수학점:18\n복필영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n복수전공필수요구학점:0복수전공필수이수학점:0\n복전영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n복수전공요구학점:0복수전공이수학점:0\n부전공영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n부전공요구학점:0부전공이수학점:0학부(과)전공제2전공학번학년이름입학구분전화번호졸업요구학점이수학점\n컴퓨터공학과 201808763천민우신입학010-4783-234913376\n일선영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n일선이수학점:\n교직영역\n영역개설학부(과)이수구분강좌명학점등급년도학기비고\n교직이수학점:0\n졸업사정결과\n교필:16.0교선:21.0전필:21.0전선:18.0일선:0.0교직:0.0복필:0.0부전:0.0복전:0.0\n총취득학점:76총평점평균:3.48채플:41편입학인정학점:학점"
mlist = orgin.split("\n")    # 엔터키를 기준으로 자른다.

print(Make_Ex(mlist))    # 결과물 출력하기
'''
학부(과)전공제2전공학번학년이름입학구분전화번호졸업요구학점이수학점
컴퓨터공학과 201808763천민우신입학010-4783-234913376

교필영역
영역개설학부(과)이수구분강좌명학점등급년도학기비고
국어컴퓨터공학부교필기초글쓰기 3A020181학기
기독교파이데이아학부교필현대인과성경 3B020212학기
파이데이아학부교필현대인과기독교 3B020221학기
사회봉사파이데이아학부교필사회봉사 1P20212학기
영어(회화)파이데이아학부교필영어커뮤니케이션(1) 2C+20181학기
파이데이아학부교필영어커뮤니케이션(2) 2B020212학기
파이데이아포럼파이데이아학부교필파이데이아포럼 1P20181학기
파이데이아학부교필대학생활과진로 1P20221학기
파이데이아학부교필채플(제자반) 0P20181학기

교선영역
영역개설학부(과)이수구분강좌명학점등급년도학기비고
3영역컴퓨터공학부교선대학수학 3A+20181학기
파이데이아학부교선대학물리학(2) 3C020212학기
파이데이아학부교선이산수학 3C+20212학기
4영역파이데이아학부교선선형대수학 3B+20221학기
파이데이아학부교선파이썬(Python)과함께하는코딩3A+20222학기
파이데이아학부교선확률과통계 3A+20222학기
컴퓨터공학부교선대학물리학(1) 3B020181학기
파이데이아학부교선채플(제자반) 0P20212학기
파이데이아학부교선채플 0P20221학기
파이데이아학부교선채플 0P20222학기
교양요구학점:37교양이수학점:37

전필영역
영역개설학부(과)이수구분강좌명학점등급년도학기비고
컴퓨터공학부전필C프로그래밍 3A020181학기
컴퓨터공학부전필컴퓨터공학입문 3C+20181학기
컴퓨터공학과전필창의적공학설계 3B020212학기
컴퓨터공학과전필데이터구조 3B020221학기
컴퓨터공학과전필자바프로그래밍 3B+20221학기
컴퓨터공학과전필데이터베이스 3A+20222학기
컴퓨터공학과전필컴퓨터네트워크 3A020222학기
전필요구학점:39전필이수학점:21

전선영역
영역개설학부(과)이수구분강좌명학점등급년도학기비고
컴퓨터공학과전선C프로그래밍응용 3C020212학기
컴퓨터공학과전선★파이썬프로그래밍 -F20212학기
컴퓨터공학과전선윈도우프로그래밍 3A+20221학기
컴퓨터공학과전선유닉스와리눅스 3B+20221학기
컴퓨터공학과전선논리회로 3A+20222학기
컴퓨터공학과전선웹표준기술 3B+20222학기
컴퓨터공학과전선파이썬프로그래밍(재수)3A020222학기
전선요구학점:27전선이수학점:18

복필영역
영역개설학부(과)이수구분강좌명학점등급년도학기비고
복수전공필수요구학점:0복수전공필수이수학점:0
복전영역
영역개설학부(과)이수구분강좌명학점등급년도학기비고
복수전공요구학점:0복수전공이수학점:0
부전공영역
영역개설학부(과)이수구분강좌명학점등급년도학기비고
부전공요구학점:0부전공이수학점:0학부(과)전공제2전공학번학년이름입학구분전화번호졸업요구학점이수학점
컴퓨터공학과 201808763천민우신입학010-4783-234913376
일선영역
영역개설학부(과)이수구분강좌명학점등급년도학기비고
일선이수학점:
교직영역
영역개설학부(과)이수구분강좌명학점등급년도학기비고
교직이수학점:0
영역개설학부(과)이수구분강좌명학점등급년도학기
비고                                          교직이수학점:0
교필:16.0교선:21.0전필:21.0전선:18.0일선:0.0교직:0.0복필:0.0부전:0.0복전:0.교필:16.0교선:21.0전필:21.0전선:18.0일선:0.0교직:0.0복필:0.0부전:0.0복전:교교필:16.0교선:21.0전필:교필:16.0교선:21.0전필:21.0전선:18.0일선:0.0교직:0.0복교필:16.0교선:21.0전필:21.0전선:18.0일선:0.0교직:0.0복필:
교필:16.0교선:21.0전필:21.0전선:18.0일선:0.0교직:0.0복필:0.0부전:0.0복전:0.0
총취득학점:76총평점평균:3.48채플:41편입학인정학점:학점
'''
 
 
 
 